Identifier: com.github.discentem.download.chrome
MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: URLDownloader
    Arguments:
      url: 'https://dl.google.com/tag/s/dl/chrome/install/googlechromestandaloneenterprise.msi'
  - Processor: EndOfCheckPhase
