Identifier: com.github.discentem.windowsterminal.download.yaml
MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: microsoft/terminal
  - Processor: URLDownloader
    Arguments:
      url: '%url%'
  - Processor: EndOfCheckPhase
  - Processor: com.github.discentem.SharedProcessors/WindowsSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_subject: "CN=Microsoft Corporation, O=Microsoft Corporation, L=Redmond, S=Washington, C=US"
