Identifier: com.github.discentem.download.YubicoPivTool
MinimumVersion: '2.3'

Input:
  re_pattern: 'href=\"(yubico-piv-tool-[0-9\.]+-mac-universal.pkg)\"'

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://developers.yubico.com/yubico-piv-tool/Releases/
      re_pattern: '%re_pattern%'
  - Processor: URLDownloader
    Arguments:
      url: 'https://developers.yubico.com/yubico-piv-tool/Releases/%match%'
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: Yubico Limited (LQA3CS5MM7)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
